kanban/app/controllers/list_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aaa"], ["user_id", 1], ["created_at", "2023-06-13 06:27:10.046124"], ["updated_at", "2023-06-13 06:27:10.046124"]]

  def update
    if @list.update(list_params)
---
UPDATE "lists" SET "title" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "たぬき"], ["updated_at", "2023-06-13 05:25:50.008193"], ["id", 1]]

  def destroy
    @list.destroy
---
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]

    def set_list
      @list = List.find_by(id: params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]